#include <stdio.h>      /* putchar, printf, perror, getchar, scanf */


// возвращает количество выведеных символов в stdout 
int printf(const char* format, ...);

// Спецификаторы преобразований
// Спецификатор                Описание
// %d или %i                   Целое число со знаком в десятичной форме
// %u                          Целое беззнаковое (unsigned) число в десятичной форме
// %o                          Целое беззнаковое (unsigned) число в восьмеричной форме
// %x или %X                   Целое беззнаковое (unsigned) число в шестнадцатеричной форме
// %f или %F                   Вещественное число в виде десятичной дроби
// %e или %E                   Вещественное число в виде экспоненциальной форме
// %c                          Символ в соответствии с текущей кодовой таблицей
// %s                          Строка (последовательность символов)
// %%                          Запись символа % в форматной строке




int main()
{

    




    return 0;
}